<?php

// 5.Таблиця множення з умовною заміною - треба написати скрипт,
// який виводить в термінал таблицю множення для всіх чисел від 1 до 9,
// але якщо добуток кратний три, замість цього добутку писати Fizz

for ($x = 1; $x <= 9; $x++) {
    for ($y = 1; $y <= 9; $y++) {
        $product = $x * $y;  // обчислюємо добуток
        if ($product % 3 == 0) {
            echo "Fizz";  // Якщо кратний трьом, виводимо "Fizz"
        } else {
            echo $product, PHP_EOL ;  // Інакше виводимо сам добуток
        }
    }
}